a = b = 2  # Пример множественного оператора присваивания.
# Обратите внимание на значения переменных a и b после выполнения данной операции.

print("a = " + str(a))  # Функция str() используется для приведения типа аргумента к строковому

print("b = " + str(b))

hello = "Привет"
print("hello = " + str(hello))
# Переопределите значение переменной hello
hello = 5
print("hello = " + str(hello))
# Создайте ещё несколько переменных, а затем осуществите их вывод через пробел
# print(...)
fact = True
number = 1736
fraction = 3.1415
text = "Леонард Эйлер"
print(text, "(" + str(number) + ")", "-", str(fraction), "-", str(fact))
print(type(hello))
